ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/UC13_0_SPI_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="UC13_0_SPI" HW_revision="1.0">
    <register id="UC13_0_SPI_CLKDIV" width="32" offset="0x1000" description="Clock Divider">
        <bitfield id="RATIO" description="Selects divide ratio of module clock" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DIV_BY_1" value="0x0" description="Do not divide clock source"/>
            <bitenum id="DIV_BY_2" value="0x1" description="Divide clock source by 2"/>
            <bitenum id="DIV_BY_3" value="0x2" description="Divide clock source by 3"/>
            <bitenum id="DIV_BY_4" value="0x3" description="Divide clock source by 4"/>
            <bitenum id="DIV_BY_5" value="0x4" description="Divide clock source by 5"/>
            <bitenum id="DIV_BY_6" value="0x5" description="Divide clock source by 6"/>
            <bitenum id="DIV_BY_7" value="0x6" description="Divide clock source by 7"/>
            <bitenum id="DIV_BY_8" value="0x7" description="Divide clock source by 8"/>
        </bitfield>
    </register>
    <register id="UC13_0_SPI_CLKSEL" width="32" offset="0x1008" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="BUSCLK_SEL" description="Selects buscclk as clock source if enabled" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Does not select this clock as a source"/>
            <bitenum id="ENABLE" value="0x1" description="Select this clock as a source"/>
        </bitfield>
    </register>
    <register id="UC13_0_SPI_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DEPRECATED" value="0x0" description="Not supported"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="UC13_0_SPI_CPU_INT" name="UC13_0_SPI_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="UC13_0_SPI_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="PER_EVT" value="0x1" description="Transmit Parity Event/interrupt pending"/>
                <bitenum id="RXFIFO_OFV_EVT" value="0x2" description="RX FIFO Overflow Event/interrupt pending"/>
                <bitenum id="RX_EVT" value="0x3" description="Receive interrupt"/>
                <bitenum id="RXFULL_EVT" value="0x4" description="RX FIFO Full Interrupt"/>
                <bitenum id="TXFIFO_UNF_EVT" value="0x5" description="TX FIFO underflow interrupt"/>
                <bitenum id="TX_EVT" value="0x6" description="Transmit Event"/>
                <bitenum id="TX_EMPTY" value="0x7" description="Transmit Buffer Empty Event/interrupt pending"/>
                <bitenum id="IDLE_EVT" value="0x9" description="End of Transmit Event/interrupt pending"/>
                <bitenum id="RTOUT_EVT" value="0xA" description="SPI receive time-out interrupt"/>
                <bitenum id="DMA_DONE_RX" value="0x10" description="DMA DONE on RX"/>
                <bitenum id="DMA_DONE_TX" value="0x11" description="DMA DONE on TX"/>
                <bitenum id="DMA_PREIRQ_RX" value="0x13" description="DMA PRE IRQ RX INTERRUPT"/>
                <bitenum id="DMA_PREIRQ_TX" value="0x14" description="DMA PRE IRQ TX INTERRUPT"/>
                <bitenum id="LTOUT" value="0x15" description="SPI line time-out interrupt"/>
            </bitfield>
        </register>
        <register id="UC13_0_SPI_CPU_INT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RX" description="Mask Receive Event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TX" description="Mask Transmit Event" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXEMPTY" description="Transmit FIFO Empty event mask." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="PER" description="Parity error event mask." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="RXFIFO overflow event mask." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="IDLE" description="SPI Idle event mask." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXFULL" description="RX FIFO Full Interrupt Mask" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="TX FIFO underflow interrupt mask" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="Enable DMA Done on RX Event Channel Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="Enable DMA Done on TX Event Channel Interrupt" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
