ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/UC13_0_SPI_1.0.xml
        <register id="UC13_0_SPI_CPU_INT_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RX" description="Receive event
When FIFO is present, this bit is set when FIFO threshold is reached
When FIFO is not present, this bit is set when a frame is received" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TX" description="Transmit event
When FIFO is present, this bit is set when Tx FIFO threshold is reached
When FIFO is not present, this bit is set when tx buffer is empty" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TXEMPTY" description="Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been move to the shift register." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="PER" description="Parity error event: this bit is set if a Parity error has been detected" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="IDLE" description="SPI has done finished transfers and changed into IDLE mode. This bit is set when BUSY goes low." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="TX FIFO Underflow Interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RXFULL" description="RX FIFO Full Interrupt" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="DMA Done on RX Event Channel Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="DMA Done on TX Event Channel Interrupt" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="UC13_0_SPI_CPU_INT_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RX" description="Masked Receive Event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TX" description="Masked Transmit FIFO event. This interrupt is set if the selected Transmit FIFO level has been reached." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TXEMPTY" description="Masked Transmit FIFO Empty event." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="PER" description="Masked Parity error event: this bit if a Parity error has been detected" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="Masked RXFIFO overflow event. This interrupt is set if an RX FIFO overflow has been detected." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="IDLE" description="Masked SPI IDLE mode event." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RXFULL" description="RX FIFO Full Interrupt" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="TX FIFO underflow interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="Masked DMA Done on RX Event Channel Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="Masked DMA Done on TX Event Channel Interrupt" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="UC13_0_SPI_CPU_INT_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RX" description="Set Receive event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="TX" description="Set Transmit event." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="TXEMPTY" description="Set Transmit FIFO Empty event." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="PER" description="Set Parity error event." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="Set RXFIFO overflow event." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="IDLE" description="Set SPI IDLE mode event." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="Set TX FIFO Underflow Event" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="RXFULL" description="Set RX FIFO Full Event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="Set DMA Done on RX Event Channel Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="Set DMA Done on TX Event Channel Interrupt" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="UC13_0_SPI_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="RX" description="Clear Receive event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TX" description="Clear Transmit event." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TXEMPTY" description="Clear Transmit FIFO Empty event." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="PER" description="Clear Parity error event." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RXFIFO_OVF" description="Clear RXFIFO overflow event." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="IDLE" description="Clear SPI IDLE mode event." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TXFIFO_UNF" description="Clear TXFIFO underflow event" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="RXFULL" description="Clear RX FIFO underflow event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="Clear DMA Done on RX Event Channel Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="Clear DMA Done on TX Event Channel Interrupt" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
