ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/UC13_0_SPI_1.0.xml
    <register id="UC13_0_SPI_STAT" width="32" offset="0x1108" description="Status Register">
        <bitfield id="TXFE" description="Transmit FIFO empty." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NOT_EMPTY" value="0x0" description="Transmit FIFO is not empty."/>
            <bitenum id="EMPTY" value="0x1" description="Transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="RXFE" description="Receive FIFO empty." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NOT_EMPTY" value="0x0" description="Receive FIFO is not empty."/>
            <bitenum id="EMPTY" value="0x1" description="Receive FIFO is empty."/>
        </bitfield>
        <bitfield id="BUSY" description="Busy" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="IDLE" value="0x0" description="SPI is in idle mode."/>
            <bitenum id="ACTIVE" value="0x1" description="SPI is currently transmitting and/or receiving data"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="RXFF" description="Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFF" description="Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full."/>
        </bitfield>
    </register>
    <register id="UC13_0_SPI_IFLS" width="32" offset="0x110C" description="Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_NOT_FULL" value="0x4" description="Opposite of full"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_NOT_EMPTY" value="0x4" description="Opposite of empty"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="UC13_0_SPI_CLKCTL" width="32" offset="0x1110" description="Clock prescaler and divider register.">
        <bitfield id="SCR" description="Serial clock divider:
This is used to generate the transmit and receive bit rate of the SPI.
The SPI bit rate is
(SPI's functional clock frequency)/((SCR+1)*2).
SCR is a value from 0-1023." begin="9" end="0" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DSAMPLE" description="Delayed sampling value. 
In controller mode the data on the input pin will be delayed sampled by the defined clock cycles of internal functional clock hence relaxing the setup time of input data. This setting is useful in systems where the board delays and external peripheral delays are more than the input setup time of the controller. Please refer to the datasheet for values of controller input setup time and assess what DSAMPLE value meets the requirement of the system.
Note: High values of DSAMPLE can cause HOLD time violations and must be factored in the calculations." begin="31" end="28" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC13_0_SPI_TXDATA" width="32" offset="0x1120" description="TXDATA Register">
        <bitfield id="DATA" description="Transmit Data
When read, last written value will be returned. If the last write to this field was a 32-bit write (with PACKEN=1), 32-bits will be returned and if the last write was a 16-bit write (PACKEN=0), those 16-bits will be returned.  
When written, one or two FIFO entries will be written depending on PACKEN value. Data values are removed from the transmit FIFO one value at a time by the transmit logic. It is loaded into the transmit serial shifter, then serially shifted out onto the TXD output pin at the programmed bit rate. 
When a data size of less than 16 bits is selected, the user must right-justify data written to the transmit FIFO. The transmit logic ignores the unused bits." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC13_0_SPI_RXDATA" width="32" offset="0x1124" description="RXDATA Register">
        <bitfield id="DATA" description="Received Data
When PACKEN=1,two entries of the FIFO are returned as a 32-bit value. When PACKEN=0, 1 entry of FIFO is returned as 16-bit value.
As data values are removed by the receive logic from the incoming data frame, they are placed into the entry in the receive FIFO, pointed to by the current FIFO write pointer.
Received data less than 16 bits is automatically right justified in the receive buffer." begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
